import math # Добавяне на външен модул към кода на програмата
def calc(x,y,z): # Функция за изчисление на лицето на триъгълника
    p=(x+y+z)/2
    s=math.sqrt(p*(p-x)*(p-y)*(p-z))
    return s # Връщане на резултат
def calc2(x,y,z):
    P =x+y+z
    return P
a=float(input("a= ")) # Въвеждане на страна от триъгълника
b=float(input("b= ")) # Въвеждане на страна от триъгълника
c=float(input("c= ")) # Въвеждане на страна от триъгълника
if (a+b<=c) or (a+c<=b) or (b+c<=a): # Проверка за съществуване на триъгълника
    print("Не съществува такъв триъгълник!")
else:
    rez=calc(a,b,c) # Викане на функция
    s="%.2f"% (rez)
    print(f"S = {s}") # Извеждане на резултат
    rez2 = calc2(a,b,c)
    P='%.2f'% (rez2)
    print(f"P = {P}")
